#შეადარეთ ორი რიცხვი ერთმანეთს ყველა შესაძლო 
# შედარების ოპერატორის გამოყენებით, ახსენით კომენტარის სახით 
# თქვენი სიტყვებით რა არის boolean ი და რაში გვჭირდება შედარების ოპერატორები
print (44 < 91)
print (91 > 44)
print (44 <= 91)
print(91 >= 44)
print (44 > 91)
print (91 < 44)
print (44 >= 91)
print (91 <= 44)


#Boolean არის მონაცემთა ტიპი, რომელსაც აქ ორი მნიშვნელობა: True (მართალია) ან False (მცდარია).
#შედარების ოპერატორები საჭიროა, იმისთვის რომ შევადაროთ ობიექტები და გავიგოთ მათ შორის ურთიერთმმფფგომარეობა. ამით პროგრამა განსაზღვრავს
# რა მხრივ იმუშაოს და რომელი მოქმედება შეასრულოს.