#7) 
#ახსენით კომენტარებით ყველა დავალება


#დავალება 1

#უნდა შევამოწმოთ არის თუ არა ასაკი 18 ან მეტი და 50-ზე ნაკლები. თუ ეს შეესაბამება, მაშინ 
# უნდა გამოვყოთ ახალგაზრდა და მოხუცი



#დავალება 2

#ამ დავალებაში უნდა შევამოწმოთ or-ის საშუალებით არის თუ არა მოცემული ციფრები 10-ზე მეტი ან 50-ზე ნაკლები

#დავალება 3

#უნდა შეგვემოწმებინა არის თუ არა ციფრი დადებითი ან ნული მაგრამ არა უარყოფითი. ანუ თუ ციფრი >=(მეტია ან ტოლი 0-ზე) 0 მაშინ გამოვიტანთ
# -დადებითი ან ნული, თუ არა უარყოფითი


#დავალება 4

# or-გამოყენებით უნდა დაგვედგინა მომხმარებლის მიერ დაწერილი ცხოველი იყო კატა ან თაგვი, ჭეშმარიტი თუ უარყოფითი


#დავალება 5


# უნდა შეგვემოწმებინა თუ რამოდენიმე რიცხვიდან ერთ-ერთი იქნებოდა დიდი 10-ზე ან ნაკლები 50-ზე (<)(>)

#დავალება 6

# შევამოწმე თუ შეყვანილი სიტყვა იქნებოდა "hello" ან "hello world" true ან false or-ის გამოყენებით.



