#8) შექმენით shopping სია სადაც მომხმარებელს შეეძლება 
# რამე ნებისმიერი პროუქტის დამატება და წაშლა, როდესაც მორჩებიან შოპინგს დაუპრინტეთ საბოლოოდ რა შეიძინეს 




print("აირჩიეთ სასურველი ციფრი პროდუქტის შესაძენად!:")

while True:
    shopping_list = input("მობილური [1]📱, ყურსასმენი [2]🎧, ლეპტოპი [3]💻, კლავიატურა [4]⌨️, მაუსი[5]🖱️, წაშლა[6]❌, დასრულება[7]✅")
    if shopping_list == "1":
        print("თქვენ შეიძინეთ მობილური!📱")
    elif shopping_list == "2":
        print("თქვვენ შეიძინეთ ყურსასმენი!🎧")
    elif shopping_list == "3":
        print("თქვენ შეიძინეთ ლეპტოპი!💻")
    elif shopping_list == "4":
        print("თქვენ შეიძინეთ კლავიატურა⌨️")
    elif shopping_list == "5":
        print("თქვენ შეიძინეთ მაუსი!🖱️")
    elif shopping_list == "6":
        del shopping_list