#    1) გაკვეთილზე გაკეთებული ორივე Kahoot-ის ყველა კითხვა ამოწერეთ და დეტალურად განიხილეთ თითოეული ჯამში 65 კითხვა იყო** 




#პირველი კაჰუტი

#1 რომელ ბიბლიოთეკას ვიყენებთ პითონში გეომეტრიული ფიგურების ასაგებად?-Turtle

#2 რომელ ფუნქციას ვიყენებთ როცა გვინდა რომ terminal-ში მოვახდინოთ ბეჭვდა- Print

#3 პითონის გამოყენებით შეუძლებელია ალგორითმის შექმნა?- false-ყველაფერი რასაც python-ში ვაკეთებთ კავშირშია ალგორითმთან

#4 ათწილადზე სამუშაოდ რომელ მონაცემთა ტიპს ვიყენებთ?  - float

#5 რომელია პითონისთვის სწორი კომენტარი? - #comment

#6 რომელ ფუნქციას ვიყენებთ მომხმარებლისგან ტერმინალიდან ტექსტის მისაღებად? - input-ფუნქციას

#7 input-დან მიღებული ინფორმაცია ინახება string-ის სახით - True, სწორია რადგანაც თუ გვსურს რომ სხვა სახით იყოს მაშინ დავუწერტ int(input) ან float(input)


#8როგორ ვამოწმებთ მონაცემთა ტიპს>? - type(x)

#9 რომელი ცვლადი ინახავს ათწილადს?- x = 10/2

#10 რომელ ვარიანტშია პითონის ცვლადი სწორად შექმნილი? - x = 12

#11 რას გამოიტანს კოდი? 
     #name = "Goal"
     #surname = "Orientadze"
     #age = 100
     #print(name + surname + age)
     #გამოიტანს error-ს რადგან ინტეჯერის და სტრინგის დამატება არ შეიძლება, მაშინ ინტი სტრინგად უნდა ვაქციოთ

#12რას გამოიტანს კოდი?
     #num1 = 10
     #num2 = 20
     #print(str(num1) + str(num2))
     #გამოიტანს--> 1020-ს

#13 რას გამოიტანს კოდი როდესაც მომხმარებელი შეიტანს 7-ს?
     #num1 = float(input("enter number : "))
     #print(type(num1))
     #გამოიტანს <class 'float'>

#14 პასუხია:
     #x = ((True and False) or (False or False))
     #y = ((False or True) and (False and True))
     #print((x and y) or True)
     #answer - True

#15 რას გამოიტანს კოდიროდესაც მომხმარებელი შეიყვანს 20-ს?
     #age = int(input("enter your age: "))
     #print(age > 18)
     #True

#მეორე კაჰუტი

#1 რას დაგვიბეჭდავს ეს კოდი ტერმინალში print(type("Hello, World!"))- str

#2 როგორ შევქმნათ პითონში კომენტარი- როგორ და #-ს გამოყენებით😀  მაგ: #this is a comment

#3 რისთვის ვიყენებთ range() ფუნქციას?- შევქმნათ რიცხვების დიაპაზონი, გვქონდეს თანნმიმდევრობა

#4 სთრინგების კონკატინაციისთვის რომელ ოპერატორსს ვიყენებთ? --> +

#5 ამ 4-დან რომელია სწორი მონაცემთა ტიპი?   str, int, list, real.---- real

#6 რომელი ფუნქციის გამოყენებით შეგვიძლია მომხმარებელს შემოვატანინოთ ინფორმაცია? - input()

#7 რომელი სიტყვით (keyword) შეიქმნა ციკლი? - for

#8 რომელი ფუნქციით გადავაქცევთ ტექსტურ ინფორმაციას ათწილადად? - float()

#9 რას დაგვიბეჭდავს ეს კოდი: print(2 > 3)? -- False


#10 რომელი კოდით შევქმნით უსასრულო ციკლს? - While True


#11 რას დაგვიბეჭდავს ეს კოდი: print("Hello" "+" "World")? - Hello World

#12 რას დაგვიბეჭდავს ეს კოდი: print(4 % 2) - 0-ს

#13 რომელია პითონის ფაილის სწორი დაბოლოება? - .py

#14 რას დაგვიბეჭდავს ეს კოდი print(10 == 10) - True

#15 ამ 4-დან რომელია სწორი ცვლადის სახელი 2nd_var, var-name, _var_name, var name სწორია ---> _var_name


#16 რას დაგვიბეჭდავს ეს კოდი: print("5" * 3)? ---> 555

#17 რას დაგვიბეჭდავს ეს კოდი: print("Hello"[-1])? - o

#18 რას დაგვიბეჭდავს ეს კოდი: print(list(range(2,10,2)))? [2,4,6,8]-ს

#19 რისთვის ვიყენებთ while-ციკლს? --- კოდი თავიდან გაეშვას როცა პირობა იქნება სწორი

#20 ამ 4-დან რომელი წინადადებაა სწორი while ციკლების შესახებ? while-ციკლი შესაძლოა უსასრულოდ გაგრძელდეს თუ მისი პირობა სულ სწორი იქნება.

#21 boolean მონაცემთა ტიპის შესაძლო მნიშვნელობებია?   True and False


#22 ამ 4 კოდიდან რომლის მნიშვნელობა იქნება True?   1<=1


#23 რომელი ოპერატორით ვამოწმებთ ორივე boolean თუ არის True-ს ტოლი?  and

#24 როგორ დავბეჭდოთ 30? my_list = [10,20,30,40]   my_list(2)

#25 ამ ოთხიდან რომელია სწორი პითონის სია?  list = [1,2,3]


#26 რას ნიშნავს Html --- HyperText Markup Language

#27 რა არის <head> თეგის დანიშნულება? საიტის ტექნიკური ინფორმაციის შენახვა

#28 რომელი თეგით შეიქმნება hyperlink? -- <a>


#29 ყველაზე დიდი სათაური რომელი თეგით შეიქმნება? <h1>

#30 რომელი ატრიბუიი გამოიყენება სურათის ალტერნატიური ტექსტის დასაწერად? ---  alt

#31 რაში გამოიყენება title თეგი?  ვქმნით html-ის დოკუმენტის სათაურს

#32 ხაზის გასაწყვეტად რომელ თეგს ვიყენებთ? - <br>

#33 დაულაგებელი სიის შესაქმნელად რომელ ელემენტს ვიყენებთ? - <ul>

#34 როგორ შევქმნათ checkbox? - <input type="checkbox">

#35 რომელი ატრიბუტიტ შეგვიძლია css-ის გაწერა?- style

#36 ტექსტის შესატანი ველი როგორ შევქმნათ - <input type="text">

#37 რომელი ატრიბუტით მივუთითებთ hyperlink-ის მისამართს? - href

#38 რას წარმოადგენს em-თეგი? - დახრილი ტექსტი

#39 რომელი თეგით შეიქმნა form? - <form>

#40 რომელი ატრიბუტით გახდება ელემენტი უნიკალური - id

#41 როგორ შევქმნათ დალაგებული სია - <ol>


#42 რომელი თეგით შეიქმნა dropdown მენიუ?   - <select>

#43 რას წარმოადგენს nav თეგი? - სექცია სადაც გვაქვს ნავიგაციის ლინკები

#44 რისთვის გამოიყენება main თეგი? საიტის მთავარი ნაწილის შექმნა

#45 რომელია html-ის კომენტარი? <!--This is a comment-->

#46 რომელი ატრიბუტით მივუთითებთ რომ input აუცილებლად უნდა შეივსოს? required

#47 სურათს რომელი თეგით დავამატებთ საიტზე? <img>


#48 აუდიო ფაილების დასამატებლად რომელ თეგს ვიყენებთ <audio>

#49 ვიდეო ფაილების დასამატებლად რომელ თეგს ვიყენებთ? <video>

#50 GOA > დანარჩენი პროგრამირების აკადემიები True

#51 სად არის საუკეთესო ხინკალი - ფასაანაურში რათქმაუნდა❤️

