#  1) შექმენით სია რომელშიც მოათვსებთ 10 განსხვავებულ მანქანის სახელს, შემდეგ დაბეჭდეთ 
# ცალ ცალკე მეორე და მეხუთე ელემენტები, დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი, დაბეჭდეთ
#  შუიდან ბოლომდე ყველა ელემენტი, დაბეჭდეთ მინუს 3 
# ინდექსზე და -1 ინდექსზე მდგომი ელემენტი, დაბეჭდეთ შუა სამი ელემენტი, დაბეჭდეთ მთლიანი სია
my_cars = ["bmw", "opel", "lamborghini", "pagani", "mustang", "audi", "porsche", "Ferrari", "tesla", "qvr"]

print(my_cars[1])
print(my_cars[4])


print(my_cars[0:5])
print(my_cars[5:10])


print(my_cars[-3])
print(my_cars[-1])
print(my_cars[3:6])

print(my_cars)