#5) დედამ გაგიშვათ აფთიაქში თავის ტკივილის წამლის საყიდლათ, ეს წამალი დღეში უნდა დალიო შენი წონის მიხედვით. 
# თუ 10 დან 20 კილომდე ხარ ნახევარი ტაბლეტი უნდა დალიო დღეში, თუ 30-40 კილომდე ხარ 1 ტაბლეთი ორჯერ დღეში და თუ
#  45 კილოზე მეტი ხარ სამი ტაბლეტი უნდა დალიო ორჯერ დღეში. თქვენი 
# მისიაა ამ ინფორმაციით გაარკვიოთ მომხარებელს რამდენი წამალი აქვს დასალევი და დღეში რამდენჯერ უნდა დალიოს.


user_weight = int(input("დაწერე შენი წონა აქ:"))

if user_weight == 10 or user_weight <= 20:
    print("შენ ნახევარი ტაბლეტი უნდა დალიო დღეში🐹")

elif user_weight == 30 or user_weight <=40:
    print("შენ 1 ტაბლეტი უნდა დალიო დღეში ორჯერ🐰")

elif user_weight > 45:
    print("შენ სამი ტაბლეტი უნდა დალიო დღეში ორჯერ🐶")


print("გისურვებ ჯანმრთელობას😍❤️")