# 3)
# რა 3 ნაწილისგან შედგება კოდის წერის პროცესი (პასუხი დაასაბუთეთ)

#პირველ რიგში ვწერთ მონაცემს და მასში ვათავსებთ რაიმე სიტყვას, (სახელს, გვარს, რიცხვს და ა.შ) შემდეგ ვიყენებთ print-ფუნქციას და ვუთითებთ რომელი
#მონაცემი გვინდა გამოვიტანოთ ტერმინალში, მაგ: თუ გვაქ მონაცემი სახელად name, მისი მნიშვენოლობა არის "tornike", print(name) და ტერმინალში გამოჩნდება 
#სახელი-tornike
#ხოლო კოდის წერას როცა მოვრჩებით, გავცემთ ბრძანებას "Run Phyton File" რათა შედეგები ვიხილოთ ტერმინალში

name = "tornike"
print(name)