#4) შექმენი სია სადაც დაამატებთ თქვენი
#  ჯგუფელების სახელებს შემდეგ კი დაბეჭდეთ აურების მიხედვით "აურები ჩატში იქნება ჩაგდებული"

my_list = ["კახა ლეკიშვილი","ლუკა ბარამიძე", "ჯეკო კურდოვანიძე", "ნიკა კორინთელი", "ნიკა გიგოშვილი", "გივიკო თუთარა", "სოფო რატიანი", "მარიამ შეყილაძე", "თორნიკე ზუბიაშვილი", "ირაკლი ახალაია", "ალექსანდრე კეკოშვილი", "გიორგი მოდებაძე", "ანასტასია ხახიაური", "ლაშაგიორგი", "ბექა ვარდუკაძე", "ქეთევან მახარაშვილი", "გვანცა კოპაძე", "დიანა ძუკაევი", "საბა რუსეიშვილი", "ირაკლი ბუბუნაური", "ნიკა ტაბატაძე", "თორნიკე ნებიერიძე", "ლაშა კაჭიური", "გიორგი თედოზაშვილი", "თორნიკე ხურცია", "გიორგი გუგავა", "გიორგი კაციტაძე", "თორნიკე ბერიძე", "ნიკა დობო"]




print(my_list)


#აურების მიხედვითაა დალაგებული 😁