# ახსენით ყველაფერი კომენტარებით

#ჩვენს დავალებებში ძირითადად ვიყენებთ for loop, და while loop-ს.
# for loop-ს ვიყენებ იმ შემთხვევაში თუ ზუსტად ვიცი ციკლი რამდენჯერ უნდა დატრიალდეს

#while loop-ს ვიყენებ ციკლის დასრულებამდე რაიმე პირობის შესასრულებლად

#ყოველი მომდევნო დავალება წინა დავალებებიდან გამომდინარეობს, მაგალითად:

#დავალება 1) დაბეჭდეთ რიცხვები while loop - ის საშვალებით რიცხვები 10 დან 1 ამდე

# numero = 10/ცვლადი შევქმენი numero= სადაც წერია 10, ანუ numero არის 10-ს ტოლი

# while numero >=1:  ამ ქმედებას რაც შეეხება, აღნიშნავს სანამ 10(ანუ numero) არის 1-ზე მეტი ან 1-ის ტოლი
#     print(numero) დაპრინტოს numero(ანუ 10)
#     numero = numero -1 მაგრამ უნდა გამოაკლდეს 10-ს 1-ით და ა.შ რომ დავიყვანოთ 1-მდე ციფრები, რაც ზუსტად მოგვცემს იმ შედეგს რა
# პირობაც გვაქვს მოცემული, ანუ 10-დან 1-მდე ოღონდ 1-ის გამოკლდებით დაწერს ყველა ციფრს.
